test/good.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getGoodRequest>
         <gs:name>Orange</gs:name>
      </gs:getGoodRequest>
   </soapenv:Body>
</soapenv:Envelope>

